//角色卡池
let gachaConfig = {
  pool: [
    {
      //up的四星角色
      up4: ["班尼特", "罗莎莉亚", "诺艾尔"],
      //up的五星角色
      up5: ["阿贝多"],
      up5_2: ["优菈"],
      endTime: "2021-12-7 18:00:00",
    },
    {
      //up的四星角色
      up4: ["五郎", "芭芭拉", "香菱"],
      //up的五星角色
      up5: ["荒泷一斗"],
      up5_2: ["荒泷一斗"],
      endTime: "2021-12-28 18:00:00",
    },
    {
      //up的四星角色
      up4: ["云堇", "凝光", "重云"],
      //up的五星角色
      up5: ["申鹤"],
      up5_2: ["魈"],
      endTime: "2022-1-18 18:00:00",
    },
    {
      //up的四星角色
      up4: ["行秋", "烟绯", "北斗"],
      //up的五星角色
      up5: ["钟离"],
      up5_2: ["甘雨"],
      endTime: "2022-2-8 18:00:00",
    },
    {
      //up的四星角色
      up4: ["雷泽", "辛焱", "迪奥娜"],
      //up的五星角色
      up5: ["八重神子"],
      up5_2: ["八重神子"],
      endTime: "2022-3-1 18:00:00",
    },
    {
      //up的四星角色
      up4: ["托马", "早柚", "九条裟罗"],
      //up的五星角色
      up5: ["雷电将军"],
      up5_2: ["珊瑚宫心海"],
      endTime: "2022-3-22 18:00:00",
    },
  ],
};

export { gachaConfig };
