//角色卡池
let gachaConfig = {
  pool: [
    {
      //up的四星角色
      up4: ["行秋", "烟绯", "北斗"],
      //up的五星角色
      up5: ["钟离"],
      up5_2: ["甘雨"],
      weapon5: ["贯虹之槊", "阿莫斯之弓"],
      weapon4: ["祭礼弓", "西风秘典", "匣里灭辰", "千岩古剑", "西风剑"],
      endTime: "2022-2-8 18:00:00",
    },
    {
      //up的四星角色
      up4: ["菲谢尔", "迪奥娜", "托马"],
      //up的五星角色
      up5: ["八重神子"],
      up5_2: ["八重神子"],
      weapon5: ["神乐之真意", "磐岩结绿"],
      weapon4: ["绝弦", "昭心", "断浪长鳍", "雨裁", "祭礼剑"],
      endTime: "2022-3-1 18:00:00",
    },
    {
      //up的四星角色
      up4: ["辛焱", "九条裟罗", "班尼特"],
      //up的五星角色
      up5: ["雷电将军"],
      up5_2: ["珊瑚宫心海"],
      weapon5: ["薙草之稻光", "不灭月华"],
      weapon4: ["曚云之月", "祭礼残章", "西风长枪", "恶王丸", "匣里龙吟"],
      endTime: "2022-3-22 18:00:00",
    },
    {
      //up的四星角色
      up4: ["砂糖", "早柚", "九条裟罗"],
      //up的五星角色
      up5: ["神里绫人"],
      up5_2: ["神里绫人"],
      weapon5: ["波乱月白经津", "飞雷之弦振"],
      weapon4: ["绝弦", "昭心", "断浪长鳍", "雨裁", "祭礼剑"],
      endTime: "2022-4-12 18:00:00",
    },
  ],
};

export { gachaConfig };
