let command = {
  gacha: "^#*(十|10|单)(连|抽)(1|2)*$",
  mysInfo: {
    role: "^#(角色)[ |0-9]*$",
    abyss: "^#[上期]*(深渊|深境|深境螺旋)[上期]*[ |0-9]*$",
    weapon: "^#[五星|四星|5星|4星]*(武器)[ |0-9]*$",
    life: "^#(五星|四星|5星|4星|命座|角色)[命座|角色]*[信息|阵容]*[ |0-9]*$",
    wife: "^#(老婆|妻子|媳妇|娘子|女朋友|女友|老公|丈夫|夫君|郎君|男朋友|男友|女儿)$",
    character: "^#(.*)$",
  },
  gachaLog:{
    bing:"(.*)authkey_ver(.*)",
    getLog:"^#*(抽卡|角色|武器|常驻|up)(记录|祈愿)$",
    help:"^#*(记录帮助|抽卡帮助)$",
    helpPort:"^#*(安卓帮助|苹果帮助|电脑帮助)$",
  },
  other: {
    help: "^#*(命令|帮助|菜单|help|说明|功能|指令)$",
  },
  face: {
    get: "noCheck",
    add: "^(.*)添加(.*)$",
    del: "^#*删除(.*)$",
    list: "^#*表情列表[0-9]*$",
  },
};
export { command };
